num1 = int(input("Введите первое число диапазона: "))
num2 = int(input("Введите второе число диапазона: "))
x,y,z, = 0,0,0,
num1,num2 = num2,num1
while x <= num1:
    if x//1:
        print("Все числа диапазона по возрастанию: ",x)
    x += 1
while x <= num1:
    if x//1:
        print("Все числа диапазона по возрастанию: ",x)
    x += 1
while x > num2:
    x -= 1
    print("Все числа диапазона по убыванию: ", x)
while y <= num1:
    if y // 7:
        print("Числа кратные 7 в диапазонe от",num2,"до",num1,":",y)
    y += 7

while z <= num1:
    if z//5:
            print("Количество чисел кратных 5 в диапазонe от",num2,"до",num1,":",num1//5)
    z += 5
